<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="123,100" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input">
					<dim>123</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="emb.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="7638, 64" offset="0" size="977664" />
			<output>
				<port id="0" precision="FP16">
					<dim>7638</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="emb.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>7638</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="emb.weight">
					<dim>7638</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_42" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="4" name="/emb/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>7638</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>123</dim>
					<dim>100</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/emb/Gather_output_0">
					<dim>123</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>123</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_1_output_0,/Shape_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="7" name="Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="9" name="/Cast" type="Convert" version="opset1">
			<data destination_type="i16" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I16" names="/Cast_output_0" />
			</output>
		</layer>
		<layer id="10" name="Constant_1868" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977672" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_1800" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977672" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="13" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Concat_output_0,/Gather_output_0,/Unsqueeze_1_output_0,/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Maximum_1869" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/Add" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I16" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I16" names="/Add_output_0">
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I16">
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Cast_2_output_0">
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977680" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_47" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="20" name="/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_49" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Squeeze_50" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="23" name="/TopK" type="TopK" version="opset11">
			<data axis="-1" mode="max" sort="value" index_element_type="i64" stable="false" />
			<input>
				<port id="0" precision="I64">
					<dim>100</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/TopK_output_0">
					<dim>100</dim>
				</port>
				<port id="3" precision="I64" names="/Cast_3_output_0,/TopK_output_1">
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_56" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977672" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="25" name="/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>123</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>100</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_3_output_0">
					<dim>123</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_131" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="977688" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Transpose_132" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>123</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>123</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_36_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="977712" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="29" name="Constant_36" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="30" name="/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977714" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977722" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/ConstantOfShape_1" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Cast_1_output_0,/ConstantOfShape_1_output_0">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_117" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977672" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="/rnn_1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>100</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/rnn_1/Gather_output_0">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/rnn_1/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/rnn_1/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/rnn_1/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977730" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/rnn_1/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Broadcast_124" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977672" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/rnn_1/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/rnn_1/Slice_output_0">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_147" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="977688" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Transpose_148" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/Cast_4" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="/Cast_4_output_0">
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="onnx::GRU_397_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 192, 64" offset="977738" size="49152" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="onnx::GRU_397" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::GRU_397">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="onnx::GRU_398_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 192, 64" offset="1026890" size="49152" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx::GRU_398" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::GRU_398">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Concat_153_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 256" offset="1076042" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Concat_153" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="GRUSequence_154" type="GRUSequence" version="opset5">
			<data direction="bidirectional" linear_before_reset="true" hidden_size="64" activations="sigmoid, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>123</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="I32">
					<dim>100</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>123</dim>
					<dim>64</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_157" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="977688" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/rnn_1/GRU_/rnn_1/GRU_output_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rnn_1/GRU_output_1">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_1940" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1077066" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/rnn_1/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>123</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rnn_1/Transpose_output_0">
					<dim>123</dim>
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/rnn_1/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1077098" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/rnn_1/Constant_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/rnn_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>123</dim>
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rnn_1/Reshape_output_0">
					<dim>123</dim>
					<dim>100</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_175" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="977688" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_176" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>123</dim>
					<dim>100</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>123</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/rnn_1/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977730" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/rnn_1/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/rnn_1/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977714" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/rnn_1/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Broadcast_168" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977672" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/rnn_1/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="/rnn_1/Slice_1_output_0">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_191" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="977688" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Transpose_192" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="onnx::GRU_440_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 192, 128" offset="1077122" size="98304" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx::GRU_440" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::GRU_440">
					<dim>2</dim>
					<dim>192</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="onnx::GRU_441_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 192, 64" offset="1175426" size="49152" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="onnx::GRU_441" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="onnx::GRU_441">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Concat_197_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 256" offset="1224578" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Concat_197" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="GRUSequence_198" type="GRUSequence" version="opset5">
			<data direction="bidirectional" linear_before_reset="true" hidden_size="64" activations="sigmoid, tanh" activations_alpha="" activations_beta="" clip="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>123</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="I32">
					<dim>100</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>128</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>123</dim>
					<dim>64</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_201" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="977688" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/rnn_1/GRU_1_/rnn_1/GRU_1_output_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rnn_1/GRU_1_output_1">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/rnn_1/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rnn_1/Concat_output_0">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_110" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="75" name="/Shape_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_3_output_0,/Shape_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/ConstantOfShape_2" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/ConstantOfShape_2_output_0">
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_7_output_0" />
			</output>
		</layer>
		<layer id="78" name="Constant_60" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/ReduceProd" type="ReduceProd" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/Cast_5_output_0,/ReduceProd_output_0" />
			</output>
		</layer>
		<layer id="80" name="/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977672" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="81" name="/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Range_output_0">
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_115" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="83" name="/ScatterElements" type="ScatterElementsUpdate" version="opset12">
			<data reduction="none" use_init_val="true" />
			<input>
				<port id="0" precision="I64">
					<dim>100</dim>
				</port>
				<port id="1" precision="I64">
					<dim>100</dim>
				</port>
				<port id="2" precision="I64">
					<dim>100</dim>
				</port>
				<port id="3" precision="I64" />
			</input>
			<output>
				<port id="4" precision="I64" names="/ScatterElements_output_0">
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_208" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977672" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="85" name="/rnn_1/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>100</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/rnn_1/Gather_1_output_0">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977730" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977730" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_1942" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1077066" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/rnn_1/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>2</dim>
					<dim>123</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rnn_1/Transpose_1_output_0">
					<dim>123</dim>
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/rnn_1/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1077098" size="24" />
			<output>
				<port id="0" precision="I64" names="/rnn_1/Constant_7_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/rnn_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>123</dim>
					<dim>100</dim>
					<dim>2</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/rnn_1/Reshape_1_output_0">
					<dim>123</dim>
					<dim>100</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_210" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977672" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="93" name="/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>123</dim>
					<dim>100</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>100</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_4_output_0">
					<dim>123</dim>
					<dim>100</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/Shape_5" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>123</dim>
					<dim>100</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_5_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_1803" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977672" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_214" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="97" name="/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_5_output_0,/Unsqueeze_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="977722" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/Concat_2_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Reshape_output_0">
					<dim>2</dim>
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977672" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="102" name="Constant_224" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="103" name="/Gather_6" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_6_output_0">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="105" name="Constant_226" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="106" name="/Gather_7" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_7_output_0">
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Constant_228" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="977664" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="108" name="/Gather_8" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/Gather_8_output_0">
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="output" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="output">
					<dim>100</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>128</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="0" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="2" />
		<edge from-layer="4" from-port="3" to-layer="25" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="2" />
		<edge from-layer="8" from-port="3" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="2" />
		<edge from-layer="13" from-port="3" to-layer="14" to-port="1" />
		<edge from-layer="13" from-port="3" to-layer="32" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="20" to-port="1" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="2" />
		<edge from-layer="20" from-port="3" to-layer="22" to-port="0" />
		<edge from-layer="21" from-port="0" to-layer="22" to-port="1" />
		<edge from-layer="22" from-port="2" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="3" to-layer="25" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="42" to-port="0" />
		<edge from-layer="23" from-port="3" to-layer="75" to-port="0" />
		<edge from-layer="23" from-port="3" to-layer="83" to-port="1" />
		<edge from-layer="23" from-port="3" to-layer="35" to-port="1" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="2" />
		<edge from-layer="25" from-port="3" to-layer="27" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="33" to-port="0" />
		<edge from-layer="30" from-port="0" to-layer="32" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="32" to-port="2" />
		<edge from-layer="32" from-port="3" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="34" from-port="0" to-layer="35" to-port="2" />
		<edge from-layer="35" from-port="3" to-layer="61" to-port="0" />
		<edge from-layer="35" from-port="3" to-layer="39" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="39" to-port="1" />
		<edge from-layer="37" from-port="0" to-layer="39" to-port="2" />
		<edge from-layer="38" from-port="0" to-layer="39" to-port="3" />
		<edge from-layer="39" from-port="4" to-layer="41" to-port="0" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="49" to-port="1" />
		<edge from-layer="42" from-port="1" to-layer="70" to-port="2" />
		<edge from-layer="42" from-port="1" to-layer="49" to-port="2" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="0" />
		<edge from-layer="44" from-port="1" to-layer="49" to-port="3" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="49" to-port="4" />
		<edge from-layer="47" from-port="0" to-layer="48" to-port="0" />
		<edge from-layer="48" from-port="1" to-layer="49" to-port="5" />
		<edge from-layer="49" from-port="6" to-layer="53" to-port="0" />
		<edge from-layer="49" from-port="7" to-layer="51" to-port="0" />
		<edge from-layer="50" from-port="0" to-layer="51" to-port="1" />
		<edge from-layer="51" from-port="2" to-layer="73" to-port="0" />
		<edge from-layer="52" from-port="0" to-layer="53" to-port="1" />
		<edge from-layer="53" from-port="2" to-layer="55" to-port="0" />
		<edge from-layer="54" from-port="0" to-layer="55" to-port="1" />
		<edge from-layer="55" from-port="2" to-layer="57" to-port="0" />
		<edge from-layer="56" from-port="0" to-layer="57" to-port="1" />
		<edge from-layer="57" from-port="2" to-layer="70" to-port="0" />
		<edge from-layer="58" from-port="0" to-layer="61" to-port="1" />
		<edge from-layer="59" from-port="0" to-layer="61" to-port="2" />
		<edge from-layer="60" from-port="0" to-layer="61" to-port="3" />
		<edge from-layer="61" from-port="4" to-layer="63" to-port="0" />
		<edge from-layer="62" from-port="0" to-layer="63" to-port="1" />
		<edge from-layer="63" from-port="2" to-layer="70" to-port="1" />
		<edge from-layer="64" from-port="0" to-layer="65" to-port="0" />
		<edge from-layer="65" from-port="1" to-layer="70" to-port="3" />
		<edge from-layer="66" from-port="0" to-layer="67" to-port="0" />
		<edge from-layer="67" from-port="1" to-layer="70" to-port="4" />
		<edge from-layer="68" from-port="0" to-layer="69" to-port="0" />
		<edge from-layer="69" from-port="1" to-layer="70" to-port="5" />
		<edge from-layer="70" from-port="7" to-layer="72" to-port="0" />
		<edge from-layer="70" from-port="6" to-layer="89" to-port="0" />
		<edge from-layer="71" from-port="0" to-layer="72" to-port="1" />
		<edge from-layer="72" from-port="2" to-layer="73" to-port="1" />
		<edge from-layer="73" from-port="2" to-layer="85" to-port="0" />
		<edge from-layer="74" from-port="0" to-layer="76" to-port="0" />
		<edge from-layer="75" from-port="1" to-layer="79" to-port="0" />
		<edge from-layer="75" from-port="1" to-layer="76" to-port="1" />
		<edge from-layer="76" from-port="2" to-layer="83" to-port="0" />
		<edge from-layer="77" from-port="0" to-layer="81" to-port="0" />
		<edge from-layer="78" from-port="0" to-layer="79" to-port="1" />
		<edge from-layer="79" from-port="2" to-layer="81" to-port="1" />
		<edge from-layer="80" from-port="0" to-layer="81" to-port="2" />
		<edge from-layer="81" from-port="3" to-layer="83" to-port="2" />
		<edge from-layer="82" from-port="0" to-layer="83" to-port="3" />
		<edge from-layer="83" from-port="4" to-layer="85" to-port="1" />
		<edge from-layer="83" from-port="4" to-layer="93" to-port="1" />
		<edge from-layer="84" from-port="0" to-layer="85" to-port="2" />
		<edge from-layer="85" from-port="3" to-layer="100" to-port="0" />
		<edge from-layer="86" from-port="0" to-layer="99" to-port="0" />
		<edge from-layer="87" from-port="0" to-layer="99" to-port="1" />
		<edge from-layer="88" from-port="0" to-layer="89" to-port="1" />
		<edge from-layer="89" from-port="2" to-layer="91" to-port="0" />
		<edge from-layer="90" from-port="0" to-layer="91" to-port="1" />
		<edge from-layer="91" from-port="2" to-layer="93" to-port="0" />
		<edge from-layer="92" from-port="0" to-layer="93" to-port="2" />
		<edge from-layer="93" from-port="3" to-layer="94" to-port="0" />
		<edge from-layer="94" from-port="1" to-layer="97" to-port="0" />
		<edge from-layer="95" from-port="0" to-layer="97" to-port="1" />
		<edge from-layer="96" from-port="0" to-layer="97" to-port="2" />
		<edge from-layer="97" from-port="3" to-layer="99" to-port="2" />
		<edge from-layer="98" from-port="0" to-layer="99" to-port="3" />
		<edge from-layer="99" from-port="4" to-layer="100" to-port="1" />
		<edge from-layer="100" from-port="2" to-layer="103" to-port="0" />
		<edge from-layer="101" from-port="0" to-layer="103" to-port="1" />
		<edge from-layer="101" from-port="0" to-layer="108" to-port="1" />
		<edge from-layer="102" from-port="0" to-layer="103" to-port="2" />
		<edge from-layer="103" from-port="3" to-layer="106" to-port="0" />
		<edge from-layer="103" from-port="3" to-layer="108" to-port="0" />
		<edge from-layer="104" from-port="0" to-layer="106" to-port="1" />
		<edge from-layer="105" from-port="0" to-layer="106" to-port="2" />
		<edge from-layer="106" from-port="3" to-layer="109" to-port="0" />
		<edge from-layer="107" from-port="0" to-layer="108" to-port="2" />
		<edge from-layer="108" from-port="3" to-layer="109" to-port="1" />
		<edge from-layer="109" from-port="2" to-layer="110" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.1.0-15008-f4afc983258-releases/2024/1" />
		<Runtime_version value="2024.1.0-15008-f4afc983258-releases/2024/1" />
		<conversion_parameters>
			<input_model value="DIR/finetuned_sgn33-new-a-Apr6.onnx" />
			<input_shape value="[123,100]" />
			<is_python_api_used value="False" />
			<output_dir value="DIR" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
